const phrases = {
    greetings: 'Привіт, я бот Водолій. Авторизуйтеся для доступу до функціоналу',
    contactRequest: 'Нам потрібен ваш номер телефону. Отримати з контактних даних телеграм?',
    dataConfirmation: (customerName, customerPhone) => {
        return `Ваш номер телефону: ${customerPhone}. Ваше імя ${customerName}. Дані вірні?`;
    },
    thanksForOrder: (customerName) => {
        return `Замовлення успішно оформлено. Дякую ${customerName}`;
    },
    congratAuth: '🎉 Ви успішно авторизувались.', 
    congratRegister: '🎉 Ви успішно зареєструвались та авторизувались.',
    mainMenu: '📋 Головне меню',
    alreadyAuth: 'Ви вже авторизовані',
    logout: '🔑 Ви вийшли з акаунту.',
    wrongPhone: 'Невірний номер телефону. Будь ласка, введіть номер телефону ще раз:',
    phoneRules: 'Введіть ваш номер телефону без +. Лише цифри. І відправте повідомлення',
    nameRequest: 'Введіть своє ім\'я:',
    chooseVendor: 'Тепер зручним для Вас способом, виберіть, будь ласка, Автомат на якому бажаєте отримати товар.',
    enterVendorNum: 'Будь ласка, введіть номер автомата.',
    accountStatus: '💳 Рахунок',
    enterTopupAmount: 'Введіть сумму БОНУСНИХ грн на яку бажаете поповнити баланс.',
    userHistory: '📊 Історія операцій'
  };
  
const keyboards = {
    startingKeyboard: [['Зробити замовлення']],
    contactRequest: [
      [ { text: 'Так', request_contact: true, } ],
      ['Ні, я введу номер вручну'],
      ['/start'],
    ],
    dataConfirmation: [
      ['Так, Оформити замовлення'],
      ['Ні, повторити введення'],
      ['/start'],
    ],
    mainMenu: [ ['⛽️ Купівля товару'], ['💳 Рахунок'], ['Вийти з акаунту'] ],
    login: [['Авторизуватись'],['Зареєструватись']],
    chooseVendor: [['Найближчі автомати'], ['Ввести номер автомата'], ['До головного меню']],
    accountStatus: [['💰 Баланс'], ['💸 Поповнити баланс'], ['⭐️ Бонуси'], ['📊 Історія операцій'], ['До головного меню']], 
    returnToBalance: [['💳 Рахунок']],
    historyMenu: [['Остання операція за рахунком'], ['💳 Рахунок']]
};

export { phrases, keyboards }